#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/m-oka-system/terraform-dynamic-credentials/runs/run-1ZjCc8EESJDeAV9U

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/exampleTFResourceGroup/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_virtual_network.example: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.web will be created
  + resource "azurerm_subnet" "web" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "web"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "exampleTFResourceGroup"
      + virtual_network_name                           = "example-network"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 0 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @m-oka-system, Action: `pull_request`*